; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; DOMAIN: Project_TER
;;
;; Description:
;; This domain models a warehouse/logistics terminal where packages are
;; processed through several stages before being shipped.
;;
;; A worker moves packages between specialized zones in the warehouse.
;;
;; Package workflow:
;;
;;     Unload -> Storage -> Preparation -> Control -> Shipping
;;
;; Each stage updates the package status and ensures that operations occur
;; in the correct order.
;;
;; Main actors:
;;   - Worker  : moves packages between locations
;;   - Package : item being processed
;;   - Location: warehouse zones and transit points
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain Project_TER)

    (:requirements :strips :typing :negative-preconditions)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; TYPES
    ;;
    ;; loc     : Any warehouse location.
    ;; package : Goods moving through the warehouse process.
    ;; worker  : Employee responsible for moving packages.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:types
        loc package worker - object
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; PREDICATES
    ;;
    ;; LOCATION PREDICATES
    ;;
    ;; (on package location)
    ;;     Indicates where a package is currently located.
    ;;
    ;; (at worker location)
    ;;     Indicates the current location of a worker.
    ;;
    ;; STATUS PREDICATES
    ;;
    ;; (arrived package)
    ;;     Package has been unloaded and registered in the system.
    ;;
    ;; (prepared package)
    ;;     Package has been prepared for shipment.
    ;;
    ;; (controlled package)
    ;;     Package has passed the inspection/control phase.
    ;;
    ;; (loaded package)
    ;;     Package has been loaded onto the shipping dock.
    ;;
    ;; CONNECTIVITY PREDICATE
    ;;
    ;; (connected location1 location2)
    ;;     A worker can move directly between these locations.
    ;;
    ;; ZONE TYPE PREDICATES
    ;;
    ;; These predicates define the purpose of each warehouse location.
    ;;
    ;; (is_arrival_zone location)
    ;; (is_storage_zone location)
    ;; (is_prep_zone location)
    ;; (is_control_zone location)
    ;; (is_shipping_dock location)
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:predicates

        ;; Package position
        (on ?y - package ?l - loc)

        ;; Worker position
        (at ?w - worker ?l - loc)

        ;; Package processing status
        (arrived ?y - package)
        (prepared ?y - package)
        (controlled ?y - package)
        (loaded ?y - package)

        ;; Location connectivity
        (connected ?l1 - loc ?l2 - loc)

        ;; Zone definitions
        (is_arrival_zone ?l - loc)
        (is_storage_zone ?l - loc)
        (is_prep_zone ?l - loc)
        (is_control_zone ?l - loc)
        (is_shipping_dock ?l - loc)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: worker_travel
    ;;
    ;; Purpose:
    ;;     Move a worker from one location to another.
    ;;
    ;; Preconditions:
    ;;     - Worker must be at the starting location.
    ;;     - The two locations must be connected.
    ;;
    ;; Effects:
    ;;     - Worker leaves the starting location.
    ;;     - Worker arrives at the destination.
    ;;
    ;; Example:
    ;;     A worker travels from the storage area to the preparation area.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action worker_travel
        :parameters (?w - worker ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (at ?w ?from))
                (at ?w ?to)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: unload
    ;;
    ;; Purpose:
    ;;     Receive a package and place it into an arrival zone.
    ;;
    ;; Preconditions:
    ;;     - Worker and package are at the same location.
    ;;     - Package has not yet been marked as arrived.
    ;;     - Destination must be an arrival zone.
    ;;     - Locations must be connected.
    ;;
    ;; Effects:
    ;;     - Package is moved to the arrival zone.
    ;;     - Worker moves with the package.
    ;;     - Package becomes officially arrived.
    ;;
    ;; Workflow Stage:
    ;;     Step 1 of the process.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action unload
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (not (arrived ?y))

                (is_arrival_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (arrived ?y)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: stockage
    ;;
    ;; Purpose:
    ;;     Move an arrived package into a storage zone.
    ;;
    ;; Preconditions:
    ;;     - Package has already arrived.
    ;;     - Package has not yet been prepared.
    ;;     - Destination must be a storage zone.
    ;;     - Locations must be connected.
    ;;
    ;; Effects:
    ;;     - Package is transferred to storage.
    ;;     - Worker moves with the package.
    ;;
    ;; Workflow Stage:
    ;;     Step 2 of the process.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action stockage
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (arrived ?y)
                (not (prepared ?y))

                (is_storage_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: prepare_command
    ;;
    ;; Purpose:
    ;;     Prepare a package before inspection and shipment.
    ;;
    ;; Preconditions:
    ;;     - Worker and package are together.
    ;;     - Package has not already been controlled.
    ;;     - Destination must be a preparation zone.
    ;;     - Locations must be connected.
    ;;
    ;; Effects:
    ;;     - Package is moved to preparation area.
    ;;     - Worker moves with package.
    ;;     - Package is marked as prepared.
    ;;
    ;; Workflow Stage:
    ;;     Step 3 of the process.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action prepare_command
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (not (controlled ?y))

                (is_prep_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (prepared ?y)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: control_check
    ;;
    ;; Purpose:
    ;;     Perform inspection and quality control on a prepared package.
    ;;
    ;; Preconditions:
    ;;     - Package must be prepared.
    ;;     - Package must not already be loaded.
    ;;     - Destination must be a control zone.
    ;;     - Locations must be connected.
    ;;
    ;; Effects:
    ;;     - Package is moved to the control area.
    ;;     - Worker moves with package.
    ;;     - Package is marked as controlled.
    ;;
    ;; Workflow Stage:
    ;;     Step 4 of the process.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action control_check
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (prepared ?y)
                (not (loaded ?y))

                (is_control_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (controlled ?y)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: load_truck
    ;;
    ;; Purpose:
    ;;     Load a validated package onto the shipping dock.
    ;;
    ;; Preconditions:
    ;;     - Package must have passed control.
    ;;     - Destination must be a shipping dock.
    ;;     - Locations must be connected.
    ;;
    ;; Effects:
    ;;     - Package is moved to the shipping dock.
    ;;     - Worker moves with package.
    ;;     - Package is marked as loaded.
    ;;
    ;; Workflow Stage:
    ;;     Step 5 (final step) of the process.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action load_truck
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (controlled ?y)

                (is_shipping_dock ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (loaded ?y)
            )
    )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PROBLEM: TER_Shift_1
;;
;; Description:
;; This problem represents a warehouse shift where a worker must process
;; two palettes received from an incoming truck.
;;
;; Both palettes must go through the complete logistics workflow:
;;
;;     Arrival -> Storage -> Preparation -> Control -> Shipping
;;
;; The objective is to move both palettes from the incoming truck to the
;; outgoing truck while ensuring they pass the control stage.
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem TER_Shift_1)

    (:domain Project_TER)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; OBJECTS
    ;;
    ;; LOCATIONS
    ;;
    ;; truck_in       : Incoming truck containing received goods.
    ;; dock_arrival   : Arrival dock where goods are unloaded.
    ;; rack_1         : Storage area for temporary inventory.
    ;; prep_area      : Area where packages are prepared.
    ;; control_point  : Inspection and quality-control area.
    ;; dock_shipping  : Shipping dock before loading.
    ;; truck_out      : Outgoing truck used for shipment.
    ;;
    ;; PACKAGES
    ;;
    ;; palette_A      : First package to process.
    ;; palette_B      : Second package to process.
    ;;
    ;; WORKERS
    ;;
    ;; cariste_1      : Warehouse worker responsible for moving packages.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:objects

        ;; Warehouse locations
        truck_in
        dock_arrival
        rack_1
        prep_area
        control_point
        dock_shipping
        truck_out - loc

        ;; Packages
        palette_A
        palette_B - package

        ;; Worker
        cariste_1 - worker
    )

    (:init

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; INITIAL POSITIONS
        ;;
        ;; The worker starts at the arrival dock.
        ;;
        ;; Both palettes are initially inside the incoming truck and
        ;; have not yet entered the warehouse workflow.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (at cariste_1 dock_arrival)

        (on palette_A truck_in)
        (on palette_B truck_in)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; ZONE DEFINITIONS
        ;;
        ;; These predicates assign a functional role to each location.
        ;;
        ;; Arrival Zone:
        ;;     Where packages first enter the warehouse.
        ;;
        ;; Storage Zone:
        ;;     Temporary storage location.
        ;;
        ;; Preparation Zone:
        ;;     Area used to prepare packages.
        ;;
        ;; Control Zone:
        ;;     Inspection and validation area.
        ;;
        ;; Shipping Dock:
        ;;     Final destination before transportation.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (is_arrival_zone dock_arrival)

        (is_storage_zone rack_1)

        (is_prep_zone prep_area)

        (is_control_zone control_point)

        (is_shipping_dock dock_shipping)
        (is_shipping_dock truck_out)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; LOCATION CONNECTIVITY
        ;;
        ;; Connections define where workers can move.
        ;;
        ;; Paths are bi-directional, allowing:
        ;;   - Movement with a package.
        ;;   - Return trips without a package.
        ;;
        ;; Warehouse Layout:
        ;;
        ;; truck_in
        ;;     |
        ;; dock_arrival
        ;;     |
        ;; rack_1
        ;;     |
        ;; prep_area
        ;;     |
        ;; control_point
        ;;     |
        ;; dock_shipping
        ;;     |
        ;; truck_out
        ;;
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (connected truck_in dock_arrival)
        (connected dock_arrival truck_in)

        (connected dock_arrival rack_1)
        (connected rack_1 dock_arrival)

        (connected rack_1 prep_area)
        (connected prep_area rack_1)

        (connected prep_area control_point)
        (connected control_point prep_area)

        (connected control_point dock_shipping)
        (connected dock_shipping control_point)

        (connected dock_shipping truck_out)
        (connected truck_out dock_shipping)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; GOAL STATE
    ;;
    ;; Success criteria:
    ;;
    ;; 1. Both palettes must be inside the outgoing truck.
    ;; 2. Both palettes must have completed the control stage.
    ;;
    ;; This guarantees that the packages have been fully processed
    ;; and are ready for shipment.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:goal
        (and

            ;; Final location of packages
            (on palette_A truck_out)
            (on palette_B truck_out)

            ;; Quality-control validation completed
            (controlled palette_A)
            (controlled palette_B)
        )
    )
)

; plan
1. (worker_travel cariste_1 dock_arrival truck_in)
   deleted: (at cariste_1 dock_arrival)
   added: (at cariste_1 truck_in)
   goals met: 0 of 4
2. (unload cariste_1 palette_b truck_in dock_arrival)
   deleted: (on palette_b truck_in) (at cariste_1 truck_in)
   added: (on palette_b dock_arrival) (at cariste_1 dock_arrival) (arrived palette_b)
   goals met: 0 of 4
3. (stockage cariste_1 palette_b dock_arrival rack_1)
   deleted: (on palette_b dock_arrival) (at cariste_1 dock_arrival)
   added: (on palette_b rack_1) (at cariste_1 rack_1)
   goals met: 0 of 4
4. (worker_travel cariste_1 rack_1 dock_arrival)
   deleted: (at cariste_1 rack_1)
   added: (at cariste_1 dock_arrival)
   goals met: 0 of 4
5. (worker_travel cariste_1 dock_arrival truck_in)
   deleted: (at cariste_1 dock_arrival)
   added: (at cariste_1 truck_in)
   goals met: 0 of 4
6. (unload cariste_1 palette_a truck_in dock_arrival)
   deleted: (on palette_a truck_in) (at cariste_1 truck_in)
   added: (on palette_a dock_arrival) (at cariste_1 dock_arrival) (arrived palette_a)
   goals met: 0 of 4
7. (worker_travel cariste_1 dock_arrival rack_1)
   deleted: (at cariste_1 dock_arrival)
   added: (at cariste_1 rack_1)
   goals met: 0 of 4
8. (prepare_command cariste_1 palette_b rack_1 prep_area)
   deleted: (on palette_b rack_1) (at cariste_1 rack_1)
   added: (on palette_b prep_area) (at cariste_1 prep_area) (prepared palette_b)
   goals met: 0 of 4
9. (worker_travel cariste_1 prep_area rack_1)
   deleted: (at cariste_1 prep_area)
   added: (at cariste_1 rack_1)
   goals met: 0 of 4
10. (worker_travel cariste_1 rack_1 dock_arrival)
   deleted: (at cariste_1 rack_1)
   added: (at cariste_1 dock_arrival)
   goals met: 0 of 4
11. (stockage cariste_1 palette_a dock_arrival rack_1)
   deleted: (on palette_a dock_arrival) (at cariste_1 dock_arrival)
   added: (on palette_a rack_1) (at cariste_1 rack_1)
   goals met: 0 of 4
12. (worker_travel cariste_1 rack_1 prep_area)
   deleted: (at cariste_1 rack_1)
   added: (at cariste_1 prep_area)
   goals met: 0 of 4
13. (control_check cariste_1 palette_b prep_area control_point)
   deleted: (on palette_b prep_area) (at cariste_1 prep_area)
   added: (on palette_b control_point) (at cariste_1 control_point) (controlled palette_b)
   goals met: 1 of 4
14. (worker_travel cariste_1 control_point prep_area)
   deleted: (at cariste_1 control_point)
   added: (at cariste_1 prep_area)
   goals met: 1 of 4
15. (worker_travel cariste_1 prep_area rack_1)
   deleted: (at cariste_1 prep_area)
   added: (at cariste_1 rack_1)
   goals met: 1 of 4
16. (prepare_command cariste_1 palette_a rack_1 prep_area)
   deleted: (on palette_a rack_1) (at cariste_1 rack_1)
   added: (on palette_a prep_area) (at cariste_1 prep_area) (prepared palette_a)
   goals met: 1 of 4
17. (worker_travel cariste_1 prep_area control_point)
   deleted: (at cariste_1 prep_area)
   added: (at cariste_1 control_point)
   goals met: 1 of 4
18. (load_truck cariste_1 palette_b control_point dock_shipping)
   deleted: (on palette_b control_point) (at cariste_1 control_point)
   added: (on palette_b dock_shipping) (at cariste_1 dock_shipping) (loaded palette_b)
   goals met: 1 of 4
19. (worker_travel cariste_1 dock_shipping control_point)
   deleted: (at cariste_1 dock_shipping)
   added: (at cariste_1 control_point)
   goals met: 1 of 4
20. (worker_travel cariste_1 control_point prep_area)
   deleted: (at cariste_1 control_point)
   added: (at cariste_1 prep_area)
   goals met: 1 of 4
21. (control_check cariste_1 palette_a prep_area control_point)
   deleted: (on palette_a prep_area) (at cariste_1 prep_area)
   added: (on palette_a control_point) (at cariste_1 control_point) (controlled palette_a)
   goals met: 2 of 4
22. (worker_travel cariste_1 control_point dock_shipping)
   deleted: (at cariste_1 control_point)
   added: (at cariste_1 dock_shipping)
   goals met: 2 of 4
23. (load_truck cariste_1 palette_b dock_shipping truck_out)
   deleted: (on palette_b dock_shipping) (at cariste_1 dock_shipping)
   added: (on palette_b truck_out) (at cariste_1 truck_out)
   goals met: 3 of 4
24. (worker_travel cariste_1 truck_out dock_shipping)
   deleted: (at cariste_1 truck_out)
   added: (at cariste_1 dock_shipping)
   goals met: 3 of 4
25. (worker_travel cariste_1 dock_shipping control_point)
   deleted: (at cariste_1 dock_shipping)
   added: (at cariste_1 control_point)
   goals met: 3 of 4
26. (load_truck cariste_1 palette_a control_point dock_shipping)
   deleted: (on palette_a control_point) (at cariste_1 control_point)
   added: (on palette_a dock_shipping) (at cariste_1 dock_shipping) (loaded palette_a)
   goals met: 3 of 4
27. (load_truck cariste_1 palette_a dock_shipping truck_out)
   deleted: (on palette_a dock_shipping) (at cariste_1 dock_shipping)
   added: (on palette_a truck_out) (at cariste_1 truck_out)
   goals met: 4 of 4
